tutorials/pimpleHFDIBFoam/Immersed-Sphere-2D-Oscillating/ImmersedSphere-Sin-Re20-200k/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  3D cube mesh for oscillating sphere in cube                                |
|  Domain: [-1,1] x [-1,1] x [-1,1]                                           |
|  Sphere D = 1, initial centre (0 0 0)                                        |
|  Motion: x_c(t) = 0.125*(1 - cos(2*pi*t)), centre x in [0,0.25]             |
|  Fine zone covers sphere swept region: x surface [-0.5,0.75]                |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    // x = -1
    (-1 -1   -1)   // 0
    (-1 -0.6 -1)   // 1
    (-1  0.6 -1)   // 2
    (-1  1   -1)   // 3
    (-1 -1    1)   // 4
    (-1 -0.6  1)   // 5
    (-1  0.6  1)   // 6
    (-1  1    1)   // 7

    // x = -0.6
    (-0.6 -1   -1) // 8
    (-0.6 -0.6 -1) // 9
    (-0.6  0.6 -1) // 10
    (-0.6  1   -1) // 11
    (-0.6 -1    1) // 12
    (-0.6 -0.6  1) // 13
    (-0.6  0.6  1) // 14
    (-0.6  1    1) // 15

    // x = 0.85
    (0.85 -1   -1) // 16
    (0.85 -0.6 -1) // 17
    (0.85  0.6 -1) // 18
    (0.85  1   -1) // 19
    (0.85 -1    1) // 20
    (0.85 -0.6  1) // 21
    (0.85  0.6  1) // 22
    (0.85  1    1) // 23

    // x = 1
    (1 -1   -1)    // 24
    (1 -0.6 -1)    // 25
    (1  0.6 -1)    // 26
    (1  1   -1)    // 27
    (1 -1    1)    // 28
    (1 -0.6  1)    // 29
    (1  0.6  1)    // 30
    (1  1    1)    // 31
);

blocks
(
    // left coarse-to-fine x region
    hex (0 8 9 1 4 12 13 5)      (12 12 60) simpleGrading (0.25 0.25 1)
    hex (1 9 10 2 5 13 14 6)     (12 60 60) simpleGrading (0.25 1 1)
    hex (2 10 11 3 6 14 15 7)    (12 12 60) simpleGrading (0.25 4 1)

    // central fine swept-sphere region
    hex (8 16 17 9 12 20 21 13)     (72 12 60) simpleGrading (1 0.25 1)
    hex (9 17 18 10 13 21 22 14)    (72 60 60) simpleGrading (1 1 1)
    hex (10 18 19 11 14 22 23 15)   (72 12 60) simpleGrading (1 4 1)

    // right fine-to-coarse x region
    hex (16 24 25 17 20 28 29 21)   (6 12 60) simpleGrading (4 0.25 1)
    hex (17 25 26 18 21 29 30 22)   (6 60 60) simpleGrading (4 1 1)
    hex (18 26 27 19 22 30 31 23)   (6 12 60) simpleGrading (4 4 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
        );
    }

    right
    {
        type wall;
        faces
        (
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }

    down
    {
        type wall;
        faces
        (
            (0 8 12 4)
            (8 16 20 12)
            (16 24 28 20)
        );
    }

    up
    {
        type wall;
        faces
        (
            (3 7 15 11)
            (11 15 23 19)
            (19 23 31 27)
        );
    }

    front
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (8 9 17 16)
            (9 10 18 17)
            (10 11 19 18)
            (16 17 25 24)
            (17 18 26 25)
            (18 19 27 26)
        );
    }

    back
    {
        type wall;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (12 20 21 13)
            (13 21 22 14)
            (14 22 23 15)
            (20 28 29 21)
            (21 29 30 22)
            (22 30 31 23)
        );
    }
);

mergePatchPairs();
